# TextureWAngle Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BumpMap..::..TextureWAngle Property
BumpMap Class See Also
---
The property labeled "Angle" from the "BumpMap" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string TextureWAngle { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TextureWAngle As String
	Get
```

Visual C++
---
```text
public:
static property String^ TextureWAngle {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 360".
# See Also
BumpMap Class
Autodesk.Revit.DB.Visual Namespace